{
  "menu": [
    {
      "url": "/peliculas/formulario",
      "nombre": "Formulario"
    },
    {
      "url": "/peliculas/listado",
      "nombre": "Listado"
    },
    {
      "url": "/peliculas/carrito",
      "nombre": "Carrito"
    }
  ],
  "catalogo-genero": [
    {
      "id": 1,
      "descripcion": "Terror"
    },
    {
      "id": 2,
      "descripcion": "Acción"
    },
    {
      "id": 3,
      "descripcion": "Fantasia"
    }
  ],
  "catalogo-clasificacion": [
    {
      "id": 1,
      "descripcion": "Para todos"
    },
    {
      "id": 2,
      "descripcion": "Mayores de 7 años"
    },
    {
      "id": 3,
      "descripcion": "Mayores de 15 años"
    }
  ],
  "pelicula": {
    "tituloPelicula": "God of war",
    "nombreDirector": "Julian",
    "actoresPrincipales": "Kratos",
    "duracion": 100,
    "idClasificacion": 1,
    "idGenero": 1,
    "fechaEstreno": "2021-06-25T05:00:00.000Z",
    "precioVenta": 300,
    "urlImagen": "https://image.png",
    "argumento": "Una pelicula muy buena",
    "id": null,
    "clasificacion": "Para todos",
    "genero": "Terror"
  },
  "pelicula-delete": [
    {
      "id": 1
    }
  ],
  "lista-peliculas": [
    {
      "tituloPelicula": "Black Widow",
      "nombreDirector": "Cate Shortland",
      "actoresPrincipales": "Scarlett Johansson",
      "duracion": 133,
      "idClasificacion": 3,
      "idGenero": 3,
      "fechaEstreno": "2012-11-22T05:00:00.000Z",
      "precioVenta": 500,
      "urlImagen": "https://archivos-cms.cinecolombia.com/images/_aliases/exhibition_poster/8/1/0/9/19018-1-esl-CO/BLACKWIDOW_DOMESTIC_PAYOFF_LAS%20(1).jpg",
      "argumento": "En BLACK WIDOW de Marvel Studios, un thriller de espías lleno de acción, Natasha Romanoff, también conocida como Black Widow, se enfrenta a lo más oscuro de sus cuentas pendientes, cuando surge una peligrosa conspiración que tiene lazos con su pasado. Perseguida por una fuerza que no se detendrá ante nada para derribarla, Natasha debe lidiar con su historia como espía y con las relaciones rotas que dejó a su paso mucho antes de convertirse en parte de los Vengadores. Scarlett Johansson vuelve como Natasha/Black Widow, Florence Pugh interpreta a Yelena, David Harbour interpreta a Alexei/The Red Guardian y Rachel Weisz es Melina. Dirigida por Cate Shortland y producida por Kevin Feige.",
      "id": 1,
      "clasificacion": "Mayores de 15 años",
      "genero": "Fantasia"
    },
    {
      "id": 2,
      "cantidad": 0,
      "tituloPelicula": "Rápidos y Furiosos 9",
      "nombreDirector": "Justin Lin",
      "actoresPrincipales": "Vin Diesel, Michelle Rodriguez, Tyrese Gibson, Chris “Ludacris” Bridges, John Cena, Jordana Brewster, Nathalie Emmanuel, Sung Kang, with Helen Mirren y Charlize Theron",
      "duracion": 145,
      "idClasificacion": 1,
      "clasificacion": "Para todos",
      "idGenero": 1,
      "genero": "Terror",
      "fechaEstreno": "24-Jun-2021",
      "precioVenta": 800,
      "urlImagen": "https://archivos-cms.cinecolombia.com/images/_aliases/poster_card/1/2/7/8/18721-5-esl-CO/FF9_DIGTAL_1_SHEET_MONTAGE_LAT-AM.jpg",
      "argumento": "Toretto lleva una vida tranquila junto a Letty y su hijo 'Little Brian', pero saben que el peligro siempre estará presente. Esta vez, la amenaza obliga a Dom a confrontar los pecados de su pasado si quiere salvar a los que más ama. El equipo se une de nuevo para frenar un complot liderado por el más experimentado asesino y conductor que han enfrentado: un hombre que resulta ser el hermano perdido de Dom, Jakob (John Cena). Amigos resucitarán, enemigos volverán y el significado de familia será puesto a prueba como nunca antes."
    },
    {
      "id": 3,
      "cantidad": 0,
      "tituloPelicula": "Ángel de mi vida",
      "nombreDirector": "Virginia María 'Viña'",
      "actoresPrincipales": "Actor numero 1",
      "duracion": 100,
      "idClasificacion": 1,
      "clasificacion": "Para todos",
      "idGenero": 1,
      "genero": "Terror",
      "fechaEstreno": "21-Jun-2021",
      "precioVenta": 500,
      "urlImagen": "https://archivos-cms.cinecolombia.com/images/_aliases/exhibition_poster_mobile/7/2/2/7/7227-31-esl-CO/ADMV_poster_480x670px.png",
      "argumento": "Ángel es un joven con discapacidad cognitiva que se entrena para ser un gran atleta, ganar carreras y lograr con esto el amor de su padre José Santos, una gloria del deporte que, al enterarse de la condición de su hijo, lo rechaza desde el momento de su nacimiento. Gracias al apoyo de su abuelo y el amor incondicional de su madre, la vida de Ángel y la relación con su familia toman un rumbo inesperado."
    },
    {
      "id": 4,
      "cantidad": 0,
      "tituloPelicula": "Space Jam: Una Nueva Era",
      "nombreDirector": "Malcolm D. Lee",
      "actoresPrincipales": "LeBron James, Don Cheable, Ceyair J Wright",
      "duracion": 120,
      "idClasificacion": 1,
      "clasificacion": "Para todos",
      "idGenero": 1,
      "genero": "Terror",
      "fechaEstreno": "21-Jul-2021",
      "precioVenta": 500,
      "urlImagen": "https://archivos-cms.cinecolombia.com/images/_aliases/exhibition_poster_mobile/1/5/0/9/19051-1-esl-CO/ARTE%20-%20SPACE%20JAM%20UNA%20NUEVA%20ERA.png",
      "argumento": "LeBron y su hijo Dom quedan atrapados en un espacio digital creado por una malvada inteligencia artificial, el basquetbolista debe regresarlos a casa sanos y salvos guiando a Bugs, Lola Bunny y a toda la banda de indisciplinados Looney Tunes hacia la victoria sobre los Goons, que son los campeones digitalizados de la inteligencia artificial en la cancha. En este partido se despliega una poderosa lista de estrellas de la NBA y la WNBA como nunca antes los habías visto."
    },
    {
      "id": 5,
      "cantidad": 0,
      "tituloPelicula": "La Purga Por Siempre",
      "nombreDirector": "Everardo Gout",
      "actoresPrincipales": "Ana de la Reguera, Tenoch Huerta, Josh Lucas, Cassidy Freeman, Leven Rambin, Alejandro Edda y Will Patton",
      "duracion": 103,
      "idClasificacion": 1,
      "clasificacion": "Para todos",
      "idGenero": 1,
      "genero": "Terror",
      "fechaEstreno": "21-Jan-2021",
      "precioVenta": 500,
      "urlImagen": "https://archivos-cms.cinecolombia.com/images/_aliases/exhibition_poster_mobile/7/0/2/9/19207-1-esl-CO/2-Cineco-poster-480x670px.png",
      "argumento": "Todas las reglas se rompen cuando una secta de maleantes sin ley decide que la purga anual no se detiene al amanecer, sino que permanecerá La Purga Por Siempre. Basada en el éxito récord de 12 Horas Para Sobrevivir de 2018, esta famosa franquicia de Blumhouse se sumerge esta vez en un terror completamente nuevo. Los miembros de un movimiento clandestino, que ya no se contentan con una noche anual de anarquía y asesinatos, deciden devolver a Estados Unidos el caos y las masacres sin fin, donde nadie volverá a estar a salvo. Adela (Ana de la Reguera, Cowboys & Aliens) y su esposo Juan (Tenoch Huerta, Días de Gracia) viven en Texas, donde Juan trabaja como peón en un rancho para la adinerada familia Tucker. Juan impresiona al patriarca Tucker, Caleb (Will Patton, Halloween), lo que atrae los celos y la ira de su hijo Dylan Tucker (Josh Lucas, Contra lo imposible). En la mañana después de la purga, una banda de asesinos enmascarados ataca violenta e ilegalmente a la familia Tucker, incluida la esposa de Dylan (Cassidy Freeman, Los honestos Gemstones de HBO) y su hermana (Leven Rambin, Los Juegos del Hambre). Tras este hecho, la familia texana tendrá que verse obligada a unirse con Juan y su esposa para enfrentar a un país a punto de colapsar, que se hunde en un mar de caos y de sangre."
    }
  ]
}